Интенсивное_обучение_программированию/src/Documents/ПКО/ПКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПКО</name>
  <basedOn>Document.СчетНаОплату</basedOn>
  <registerRecords>AccountingRegister.БухгалтерскиеПроводки</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Интенсивное_обучение_программированию/src/AccountingRegisters/БухгалтерскиеПроводки/БухгалтерскиеПроводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>БухгалтерскиеПроводки</name>
  <chartOfAccounts>ChartOfAccounts.ПланыСчетовБухгалтерии</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
    <balance>true</balance>
  </resources>
</mdclass:AccountingRegister>

Интенсивное_обучение_программированию/src/Documents/СчетНаОплату/СчетНаОплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетНаОплату</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Интенсивное_обучение_программированию/src/ChartsOfAccounts/ПланыСчетовБухгалтерии/ПланыСчетовБухгалтерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>ПланыСчетовБухгалтерии</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50       </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Контрагент</name>
      <description>Контрагент</description>
      <code>62       </code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

Интенсивное_обучение_программированию/src/Documents/ПКО/ObjectModule.bsl
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплату") Тогда

	    Запрос = Новый Запрос;
	    Запрос.Текст =
	    	"ВЫБРАТЬ
	    	|	СчетНаОплату.Контрагент,
	    	|	СчетНаОплату.Сумма КАК Сумма,
	    	|	СчетНаОплату.Ссылка КАК Основание
	    	|ИЗ
	    	|	Документ.СчетНаОплату КАК СчетНаОплату
	    	|ГДЕ
	    	|	СчетНаОплату.Ссылка = &Ссылка";
	    
	    Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	    РезультатЗапроса = Запрос.Выполнить();
	    
	    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	    ВыборкаДетальныеЗаписи.Следующий();
	    ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаДетальныеЗаписи);
	    
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.БухгалтерскиеПроводки.Записывать = Истина;
	Движение = Движения.БухгалтерскиеПроводки.Добавить();
	Движение.СчетДт = ПланыСчетов.ПланыСчетовБухгалтерии.Касса;
	Движение.СчетКт = ПланыСчетов.ПланыСчетовБухгалтерии.Контрагент;
	Движение.Период = Дата;
	Движение.Сумма = Сумма;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагент] = Контрагент;

КонецПроцедуры

#КонецЕсли

#КонецОбласти
